app/Controllers/Auth.php

SELECT *
FROM `usuarios`
WHERE `estado` = 'A'
SELECT *
FROM `emails`
WHERE `estado` = 'A'
SELECT *
FROM `telefonos`
WHERE `estado` = 'A'
---
    public function registroPagina(){
        $usuario = $this->usuario->where('estado', "A")->findAll();
        $parametros = $this->parametros->obtener_encabezado_3();
        $email = $this->email->where('estado', "A")->findAll();
        $telefono = $this->telefono->where('estado', "A")->findAll();

INSERT INTO `usuarios` (`usuario`, `nombre`, `apellido`, `tipo_documento`, `num_documento`, `pass`, `fecha_crea`) VALUES ('fsdf7h', 'Daniel', 'f', '9', '9094215', '$2y$10$MiK7Jxqqu0KYq2JthwEYXucqZYHXnonwkfeBzDEdTBx6yp4s3r7jW', '2023-05-22 16:40:27')
---
    public function guardar(){

        if ($this->request->getMethod() == "post" ) {

            $password = $this->request->getPost('pass1');
            $hashed_password = password_hash($password, PASSWORD_DEFAULT);

            $this->usuario->save([
                'usuario' => $this->request->getPost('usuario'),
                'nombre' => $this->request->getPost('nombre'),
                'apellido' => $this->request->getPost('apellido'),
                'tipo_documento' => $this->request->getPost('tipo_documento'),
                'documento' => $this->request->getPost('num_documento'),
                'pass' => $hashed_password
            ]);

            $id_usuario = $this -> usuario ->insertID();