app/Controllers/Emergencia.php

SELECT *
FROM `disponibles`
WHERE `id_usuario` = '28'
 LIMIT 1
---
    public function insertar()
    {
        $session = session();
        $id_usuario = $session->get('id_usuario');

        // Obtiene el registro disponible del usuario actual
        $disponibleModel = new DisponibleModel();
        $disponible = $disponibleModel->where('id_usuario', $id_usuario)->first();

UPDATE `disponibles` SET `presupuesto_anual` = 10744679
WHERE `disponibles`.`id_disponible` IN ('26')
---
            $nuevoPresupuesto = $disponible['presupuesto_anual'] - $emergencia_valor;
            $egreso_total = $disponible['egreso'] + $emergencia_valor;

            $disponibleModel->update($disponible['id_disponible'], ['presupuesto_anual' => $nuevoPresupuesto]);