app/Controllers/Usuario.php

SELECT *
FROM `usuarios`
WHERE `estado` = 'A'
SELECT *
FROM `emails`
WHERE `estado` = 'A'
SELECT *
FROM `telefonos`
WHERE `estado` = 'A'
---
    public function index()
    {
        $this->verificarAutenticacion();

        $usuario = $this->usuario->where('estado', "A")->findAll();
        $parametro = $this->parametro->obtener_encabezado_3();
        $rol = $this->rol->where('estado', "A")->findAll();
        $email = $this->email->where('estado', "A")->findAll();
        $telefono = $this->telefono->where('estado', "A")->findAll();