app/Models/AgendaModel.php

    public function traer_todos_los_eventos(){
        $this->select('agenda.*');
        $datos = $this->find();
---
SELECT `agenda`.*
FROM `agenda`