app/Models/SaquitoModel.php

        public function completar_saquito($id,$estado){
            $datos = $this->update($id, ['estado' => $estado]);
---
UPDATE `saquitos` SET `estado` = 'C'
WHERE `saquitos`.`id_saquito` IN ('72')